squidink_api/app/controllers/users_controller.rb

  def index # GET /users
    @users = User.all
---
SELECT "users".* FROM "users"

  def show # GET /users/#
    @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]